{"draft":"draft-ietf-lemonade-goals-05","doc_id":"RFC4416","title":"Goals for Internet Messaging to Support Diverse Service Environments","authors":["J. Wong, Ed."],"format":["ASCII","HTML"],"page_count":"43","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Enhancements to Internet email to support diverse service environments","abstract":"This document is a history capturing the background, motivation and\r\nthinking during the LEMONADE definition and design process.\r\n\r\nThe LEMONADE Working Group -- Internet email to support diverse\r\nservice environments -- is chartered to provide enhancements to\r\nInternet mail to facilitate its use by more diverse clients.  In\r\nparticular, by clients on hosts not only operating in environments\r\nwith high latency\/bandwidth-limited unreliable links but also\r\nconstrained to limited resources.  The enhanced mail must be\r\nbackwards compatible with existing Internet mail.\r\n\r\nThe primary motivation for this effort is -- by making Internet mail\r\nprotocols richer and more adaptable to varied media and environments\r\n-- to allow mobile handheld devices tetherless access to Internet\r\nmail using only IETF mail protocols.\r\n\r\nThe requirements for these devices drive a discussion of the possible\r\nprotocol enhancements needed to support multimedia messaging on\r\nlimited-capability hosts in diverse service environments.  A list of\r\ngeneral principles to guide the design of the enhanced messaging\r\nprotocols is documented.  Finally, additional issues of providing seamless\r\nservice between enhanced Internet mail and the existing separate\r\nmobile messaging infrastructure are briefly listed.  This memo provides information for the Internet community.","pub_date":"February 2006","keywords":["IMAP","protocol extensions","messaging","wireless","handheld","telephone user interface","multi-modal","LEMONADE","extension principles","history","background","motivation","cellular","interworking","constraints","TUI","WUI","client","MMS"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC4416","errata_url":null}