{"draft":"draft-bonica-internet-icmp-16","doc_id":"RFC4884","title":"Extended ICMP to Support Multi-Part Messages","authors":["R. Bonica","D. Gan","D. Tappan","C. Pignataro"],"format":["ASCII","HTML"],"page_count":"19","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"IETF - NON WORKING GROUP","abstract":"This document redefines selected ICMP messages to support multi-part\r\noperation.  A multi-part ICMP message carries all of the information\r\nthat ICMP messages carried previously, as well as additional\r\ninformation that applications may require.\r\n\r\nMulti-part messages are supported by an ICMP extension structure.\r\nThe extension structure is situated at the end of the ICMP message.\r\nIt includes an extension header followed by one or more extension\r\nobjects.  Each extension object contains an object header and object\r\npayload.  All object headers share a common format.\r\n\r\nThis document further redefines the above mentioned ICMP messages by\r\nspecifying a length attribute.  All of the currently defined ICMP\r\nmessages to which an extension structure can be appended include an\r\n\"original datagram\" field.  The \"original datagram\" field contains\r\nthe initial octets of the datagram that elicited the ICMP error\r\nmessage.  Although the original datagram field is of variable length,\r\nthe ICMP message does not include a field that specifies its length.\r\nTherefore, in order to facilitate message parsing, this document\r\nallocates eight previously reserved bits to reflect the length of the\r\n\"original datagram\" field.\r\n\r\nThe proposed modifications change the requirements for ICMP\r\ncompliance.  The impact of these changes on compliant implementations\r\nis discussed, and new requirements for future implementations are\r\npresented.\r\n\r\nThis memo updates RFC 792 and RFC 4443.  [STANDARDS-TRACK]","pub_date":"April 2007","keywords":["[--------|p]","internet control message protocol","length attribute"],"obsoletes":[],"obsoleted_by":[],"updates":["RFC0792","RFC4443"],"updated_by":["RFC8335"],"see_also":[],"doi":"10.17487\/RFC4884","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc4884"}