{"draft":"draft-ietf-manet-dsr-10","doc_id":"RFC4728","title":"The Dynamic Source Routing Protocol (DSR) for Mobile Ad Hoc Networks for IPv4","authors":["D. Johnson","Y. Hu","D. Maltz"],"format":["ASCII","HTML"],"page_count":"107","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Mobile Ad-hoc Networks","abstract":"The Dynamic Source Routing protocol (DSR) is a simple and efficient\r\nrouting protocol designed specifically for use in multi-hop wireless\r\nad hoc networks of mobile nodes.  DSR allows the network to be\r\ncompletely self-organizing and self-configuring, without the need for\r\nany existing network infrastructure or administration.  The protocol\r\nis composed of the two main mechanisms of \"Route Discovery\" and\r\n\"Route Maintenance\", which work together to allow nodes to discover\r\nand maintain routes to arbitrary destinations in the ad hoc network.\r\nAll aspects of the protocol operate entirely on demand, allowing\r\nthe routing packet overhead of DSR to scale automatically to only\r\nwhat is needed to react to changes in the routes currently in use.  The\r\nprotocol allows multiple routes to any destination and allows each\r\nsender to select and control the routes used in routing its packets,\r\nfor example, for use in load balancing or for increased robustness.\r\nOther advantages of the DSR protocol include easily guaranteed\r\nloop-free routing, operation in networks containing unidirectional\r\nlinks, use of only \"soft state\" in routing, and very rapid recovery\r\nwhen routes in the network change.  The DSR protocol is designed\r\nmainly for mobile ad hoc networks of up to about two hundred nodes\r\nand is designed to work well even with very high rates of mobility.\r\nThis document specifies the operation of the DSR protocol for routing\r\nunicast IPv4 packets.  This memo defines an Experimental Protocol for the Internet community.","pub_date":"February 2007","keywords":["[--------|e]","route discovery","route maintenance"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC4728","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc4728"}