{"draft":"draft-ietf-tsvwg-quickstart-07","doc_id":"RFC4782","title":"Quick-Start for TCP and IP","authors":["S. Floyd","M. Allman","A. Jain","P. Sarolahti"],"format":["ASCII","HTML"],"page_count":"82","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Transport and Services Working Group","abstract":"This document specifies an optional Quick-Start mechanism for\r\ntransport protocols, in cooperation with routers, to determine an\r\nallowed sending rate at the start and, at times, in the middle of a\r\ndata transfer (e.g., after an idle period).  While Quick-Start is\r\ndesigned to be used by a range of transport protocols, in this\r\ndocument we only specify its use with TCP.  Quick-Start is designed\r\nto allow connections to use higher sending rates when there is\r\nsignificant unused bandwidth along the path, and the sender and all\r\nof the routers along the path approve the Quick-Start Request.\r\n\r\nThis document describes many paths where Quick-Start Requests would\r\nnot be approved.  These paths include all paths containing routers,\r\nIP tunnels, MPLS paths, and the like that do not support Quick-\r\nStart.  These paths also include paths with routers or middleboxes\r\nthat drop packets containing IP options.  Quick-Start Requests could\r\nbe difficult to approve over paths that include multi-access layer-\r\ntwo networks.  This document also describes environments where the\r\nQuick-Start process could fail with false positives, with the sender\r\nincorrectly assuming that the Quick-Start Request had been approved\r\nby all of the routers along the path.  As a result of these\r\nconcerns, and as a result of the difficulties and seeming absence of\r\nmotivation for routers, such as core routers to deploy Quick-Start,\r\nQuick-Start is being proposed as a mechanism that could be of use in\r\ncontrolled environments, and not as a mechanism that would be\r\nintended or appropriate for ubiquitous deployment in the global\r\nInternet.  This memo defines an Experimental Protocol for the Internet community.","pub_date":"January 2007","keywords":["[--------|e]"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC4782","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc4782"}