{"draft":"draft-irtf-p2prg-survey-search-01","doc_id":"RFC4981","title":"Survey of Research towards Robust Peer-to-Peer Networks: Search Methods","authors":["J. Risson","T. Moors"],"format":["ASCII","HTML"],"page_count":"91","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"INDEPENDENT","abstract":"The pace of research on peer-to-peer (P2P) networking in the last\r\nfive years warrants a critical survey.  P2P has the makings of a\r\ndisruptive technology -- it can aggregate enormous storage and\r\nprocessing resources while minimizing entry and scaling costs.\r\n\r\nFailures are common amongst massive numbers of distributed peers,\r\nthough the impact of individual failures may be less than in\r\nconventional architectures.  Thus, the key to realizing P2P's potential\r\nin applications other than casual file sharing is robustness.\r\n\r\nP2P search methods are first couched within an overall P2P taxonomy.\r\nP2P indexes for simple key lookup are assessed, including those based\r\non Plaxton trees, rings, tori, butterflies, de Bruijn graphs, and skip\r\ngraphs.  Similarly, P2P indexes for keyword lookup, information\r\nretrieval and data management are explored.  Finally, early efforts to\r\noptimize range, multi-attribute, join, and aggregation queries over\r\nP2P indexes are reviewed.  Insofar as they are available in the\r\nprimary literature, robustness mechanisms and metrics are highlighted\r\nthroughout.  However, the low-level mechanisms that most affect\r\nrobustness are not well isolated in the literature.  Recommendations\r\nare given for future research.  This memo provides information for the Internet community.","pub_date":"September 2007","keywords":["Peer-to-peer network","Distributed hash table","Structured overlay","Unstructured overlay","Key-based routing","Consistent hashing","Scalable distributed data structure","Dependability","Hypercube","Plaxton tree","de Bruijn graph","Skip graph","Torus","Butterfly network","Vector model","Latent semantic indexing"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC4981","errata_url":null}