{"draft":"draft-hutzler-spamops-08","doc_id":"RFC5068","title":"Email Submission Operations: Access and Accountability Requirements","authors":["C. Hutzler","D. Crocker","P. Resnick","E. Allman","T. Finch"],"format":["ASCII","HTML"],"page_count":"12","pub_status":"BEST CURRENT PRACTICE","status":"BEST CURRENT PRACTICE","source":"IETF - NON WORKING GROUP","abstract":"Email has become a popular distribution service for a variety of\r\nsocially unacceptable, mass-effect purposes.  The most obvious ones\r\ninclude spam and worms.  This note recommends conventions for the\r\noperation of email submission and transport services between\r\nindependent operators, such as enterprises and Internet Service\r\nProviders.  Its goal is to improve lines of accountability for\r\ncontrolling abusive uses of the Internet mail service.  To this end,\r\nthis document offers recommendations for constructive operational\r\npolicies between independent operators of email submission and\r\ntransmission services.\r\n\r\nEmail authentication technologies are aimed at providing assurances\r\nand traceability between internetworked networks.  In many email\r\nservices, the weakest link in the chain of assurances is initial\r\nsubmission of a message.  This document offers recommendations for\r\nconstructive operational policies for this first step of email\r\nsending, the submission (or posting) of email into the transmission\r\nnetwork.  Relaying and delivery entail policies that occur subsequent\r\nto submission and are outside the scope of this document.  This document specifies an Internet Best Current Practices for the\r\nInternet Community, and requests discussion and suggestions for\r\nimprovements.","pub_date":"November 2007","keywords":["[--------|b]","spam","email abuse","phishing","email","e-mail","service","mime","rfc2822","rfc 2822","rfc822","rfc 822","rfc2821","rfc 2821","rfc821","rfc 821","architecture","mta","mua","msa","mda","user","delivery","relay","header","gateway agent","sieve","dsn","mdn","tussle","mhs","mail handling service","message transfer agent","message user agent","mail submission agent","mail delivery agent"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC8314"],"see_also":["BCP0134"],"doi":"10.17487\/RFC5068","errata_url":null}