{"draft":"draft-ietf-ccamp-rsvp-restart-ext-09","doc_id":"RFC5063","title":"Extensions to GMPLS Resource Reservation Protocol (RSVP) Graceful Restart","authors":["A. Satyanarayana, Ed.","R. Rahman, Ed."],"format":["ASCII","HTML"],"page_count":"24","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Common Control and Measurement Plane","abstract":"This document describes extensions to the Resource Reservation\r\nProtocol (RSVP) Graceful Restart mechanisms defined in RFC 3473.  The\r\nextensions enable the recovery of RSVP signaling state based on the\r\nPath message last sent by the node being restarted.\r\n\r\nPreviously defined Graceful Restart mechanisms, also called recovery\r\nfrom nodal faults, permit recovery of signaling state from adjacent\r\nnodes when the data plane has retained the associated forwarding\r\nstate across a restart.  Those mechanisms do not fully support\r\nsignaling state recovery on ingress nodes or recovery of all RSVP\r\nobjects.\r\n\r\nThe extensions defined in this document build on the RSVP Hello\r\nextensions defined in RFC 3209, and extensions for state recovery on\r\nnodal faults defined in RFC 3473.  Using these extensions, the\r\nrestarting node can recover all previously transmitted Path state,\r\nincluding the Explicit Route Object and the downstream (outgoing)\r\ninterface identifiers.  The extensions can also be used to recover\r\nsignaling state after the restart of an ingress node.\r\n\r\nThese extensions are not used to create or restore data plane state.\r\n\r\nThe extensions optionally support the use of Summary Refresh, defined\r\nin RFC 2961, to reduce the number of messages exchanged during the\r\nRecovery Phase when the restarting node has recovered signaling state\r\nlocally for one or more Label Switched Paths (LSPs).  [STANDARDS-TRACK]","pub_date":"October 2007","keywords":["[--------|p]","nodal faults","rsvp hello","state recovery"],"obsoletes":[],"obsoleted_by":[],"updates":["RFC2961","RFC3473"],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5063","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5063"}