{"draft":"draft-ietf-ospf-manet-mdr-05","doc_id":"RFC5614","title":"Mobile Ad Hoc Network (MANET) Extension of OSPF Using Connected Dominating Set (CDS) Flooding","authors":["R. Ogier","P. Spagnolo"],"format":["ASCII","HTML"],"page_count":"71","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Open Shortest Path First IGP","abstract":"This document specifies an extension of OSPFv3 to support mobile ad\r\nhoc networks (MANETs).  The extension, called OSPF-MDR, is designed\r\nas a new OSPF interface type for MANETs.  OSPF-MDR is based on the\r\nselection of a subset of MANET routers, consisting of MANET\r\nDesignated Routers (MDRs) and Backup MDRs.  The MDRs form a connected\r\ndominating set (CDS), and the MDRs and Backup MDRs together form a\r\nbiconnected CDS for robustness.  This CDS is exploited in two ways.\r\nFirst, to reduce flooding overhead, an optimized flooding procedure\r\nis used in which only (Backup) MDRs flood new link state\r\nadvertisements (LSAs) back out the receiving interface; reliable\r\nflooding is ensured by retransmitting LSAs along adjacencies.\r\nSecond, adjacencies are formed only between (Backup) MDRs and a\r\nsubset of their neighbors, allowing for much better scaling in dense\r\nnetworks.  The CDS is constructed using 2-hop neighbor information\r\nprovided in a Hello protocol extension.  The Hello protocol is\r\nfurther optimized by allowing differential Hellos that report only\r\nchanges in neighbor states.  Options are specified for originating\r\nrouter-LSAs that provide full or partial topology information,\r\nallowing overhead to be reduced by advertising less topology\r\ninformation.  This memo defines an Experimental Protocol for the \r\nInternet community.","pub_date":"August 2009","keywords":["[--------]","MANET routing","link-state routing","CDS flooding","mesh network","MANET Designated Router","MDR"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC7038","RFC9454"],"see_also":[],"doi":"10.17487\/RFC5614","errata_url":null}