{"draft":"draft-ietf-rserpool-asap-21","doc_id":"RFC5352","title":"Aggregate Server Access Protocol (ASAP)","authors":["R. Stewart","Q. Xie","M. Stillman","M. Tuexen"],"format":["ASCII","HTML"],"page_count":"53","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Reliable Server Pooling","abstract":"Aggregate Server Access Protocol (ASAP; RFC 5352), in conjunction\r\nwith the Endpoint Handlespace Redundancy Protocol (ENRP; RFC 5353),\r\nprovides a high-availability data transfer mechanism over IP\r\nnetworks.  ASAP uses a handle-based addressing model that isolates a\r\nlogical communication endpoint from its IP address(es), thus\r\neffectively eliminating the binding between the communication\r\nendpoint and its physical IP address(es), which normally constitutes\r\na single point of failure.\r\n\r\nIn addition, ASAP defines each logical communication destination as a\r\npool, providing full transparent support for server pooling and load\r\nsharing.  It also allows dynamic system scalability -- members of a\r\nserver pool can be added or removed at any time without interrupting\r\nthe service.\r\n\r\nASAP is designed to take full advantage of the network level\r\nredundancy provided by the Stream Transmission Control Protocol\r\n(SCTP; RFC 4960).  Each transport protocol, other than SCTP, MUST\r\nhave an accompanying transport mapping document.  It should be noted\r\nthat ASAP messages passed between Pool Elements (PEs) and ENRP\r\nservers MUST use the SCTP transport protocol.\r\n\r\nThe high-availability server pooling is gained by combining two\r\nprotocols, namely ASAP and ENRP, in which ASAP provides the user\r\ninterface for Pool Handle to address translation, load sharing\r\nmanagement, and fault management, while ENRP defines the high-\r\navailability Pool Handle translation service.  This memo defines an \r\nExperimental Protocol for the Internet community.","pub_date":"September 2008","keywords":["[--------]","rserpool","enrp","endpoint handlespace redundancy protocol"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5352","errata_url":null}