{"draft":"draft-ietf-ancp-framework-13","doc_id":"RFC5851","title":"Framework and Requirements for an Access Node Control Mechanism in Broadband Multi-Service Networks","authors":["S. Ooghe","N. Voigt","M. Platnic","T. Haag","S. Wadhwa"],"format":["ASCII","HTML"],"page_count":"47","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Access Node Control Protocol","abstract":"The purpose of this document is to define a framework for an Access\r\nNode Control Mechanism between a Network Access Server (NAS) and an\r\nAccess Node (e.g., a Digital Subscriber Line Access Multiplexer\r\n(DSLAM)) in a multi-service reference architecture in order to\r\nperform operations related to service, quality of service, and\r\nsubscribers.  The Access Node Control Mechanism will ensure that the\r\ntransmission of the information does not need to go through distinct\r\nelement managers but rather uses a direct device-device\r\ncommunication.  This allows for performing access-link-related\r\noperations within those network elements, while avoiding impact on\r\nthe existing Operational Support Systems.\r\n\r\nThis document first identifies a number of use cases for which the\r\nAccess Node Control Mechanism may be appropriate.  It then presents\r\nthe requirements for the Access Node Control Protocol (ANCP) that\r\nmust be taken into account during protocol design.  Finally, it\r\ndescribes requirements for the network elements that need to support\r\nANCP and the described use cases.  These requirements should be seen\r\nas guidelines rather than as absolute requirements.  RFC 2119\r\ntherefore does not apply to the nodal requirements.  This document \r\nis not an Internet Standards Track specification; it is published \r\nfor informational purposes.","pub_date":"May 2010","keywords":["Access Node Control Protocol","Topology Discovery","Loop Configuration","Remote Connectivity Test","Multicast","Access Node","Network Access Server"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5851","errata_url":null}