{"draft":"draft-ietf-ips-iwarp-da-05","doc_id":"RFC5047","title":"DA: Datamover Architecture for the Internet Small Computer System Interface (iSCSI)","authors":["M. Chadalapaka","J. Hufferd","J. Satran","H. Shah"],"format":["ASCII","HTML"],"page_count":"49","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"IP Storage","abstract":"The Internet Small Computer System Interface (iSCSI) is a SCSI\r\ntransport protocol that maps the SCSI family\r\nof application protocols onto TCP\/IP.  Datamover Architecture\r\nfor iSCSI (DA) defines an abstract model in which the\r\nmovement of data between iSCSI end nodes is logically\r\nseparated from the rest of the iSCSI protocol in order to\r\nallow iSCSI to adapt to innovations available in new IP\r\ntransports.  While DA defines the architectural functions\r\nrequired of the class of Datamover protocols, it does not\r\ndefine any specific Datamover protocols.  Each such Datamover\r\nprotocol, defined in a separate document, provides a\r\nreliable transport for all iSCSI PDUs, but actually moves the\r\ndata required for certain iSCSI PDUs without involving the\r\nremote iSCSI layer itself.  This document begins with an\r\nintroduction of a few new abstractions, defines a layered\r\narchitecture for iSCSI and Datamover protocols, and then\r\nmodels the interactions within an iSCSI end node between the\r\niSCSI layer and the Datamover layer that happen in order to\r\ntransparently perform remote data movement within an IP\r\nfabric.  It is intended that this definition will help map\r\niSCSI to generic Remote Direct Memory Access (RDMA)-capable IP fabrics in the future\r\ncomprising TCP, the Stream Control Transmission Protocol (SCTP), and\r\npossibly other underlying network transport layers, such as InfiniBand.  This memo provides information for the Internet community.","pub_date":"October 2007","keywords":["scsi transport protocol","tcp\/ip"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC7146"],"see_also":[],"doi":"10.17487\/RFC5047","errata_url":null}