{"draft":"draft-narten-iana-considerations-rfc2434bis-09","doc_id":"RFC5226","title":"Guidelines for Writing an IANA Considerations Section in RFCs","authors":["T. Narten","H. Alvestrand"],"format":["ASCII","HTML"],"page_count":"27","pub_status":"BEST CURRENT PRACTICE","status":"BEST CURRENT PRACTICE","source":"IETF - NON WORKING GROUP","abstract":"Many protocols make use of identifiers consisting of constants and\r\nother well-known values.  Even after a protocol has been defined and\r\ndeployment has begun, new values may need to be assigned (e.g., for a\r\nnew option type in DHCP, or a\r\nnew encryption or authentication transform for IPsec).  To ensure that\r\nsuch quantities have consistent values and interpretations across all\r\nimplementations, their assignment must be administered by a central\r\nauthority.  For IETF protocols, that role is provided by the Internet\r\nAssigned Numbers Authority (IANA).\r\n\r\nIn order for IANA to manage a given namespace prudently, it needs\r\nguidelines describing the conditions under which new values can be\r\nassigned or when modifications to existing values can be made.  If\r\nIANA is expected to play a role in the management of a namespace,\r\nIANA must be given clear and concise instructions describing that\r\nrole.  This document discusses issues that should be considered in\r\nformulating a policy for assigning values to a namespace and\r\nprovides guidelines for authors on the specific text that\r\nmust be included in documents that place demands on IANA.\r\n\r\nThis document obsoletes RFC 2434.  This document specifies an Internet Best \r\nCurrent Practices for the Internet Community, and requests discussion and \r\nsuggestions for improvements.","pub_date":"May 2008","keywords":["[--------]","internet assigned numbers authority","values","implementations","code point","protocol constant","protocol parameter"],"obsoletes":["RFC2434"],"obsoleted_by":["RFC8126"],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5226","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5226"}