{"draft":"draft-ietf-tcpm-ecnsyn-10","doc_id":"RFC5562","title":"Adding Explicit Congestion Notification (ECN) Capability to TCP's SYN\/ACK Packets","authors":["A. Kuzmanovic","A. Mondal","S. Floyd","K. Ramakrishnan"],"format":["ASCII","HTML"],"page_count":"33","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"TCP Maintenance and Minor Extensions","abstract":"The proposal in this document is Experimental.  While it may be\r\ndeployed in the current Internet, it does not represent a consensus\r\nthat this is the best possible mechanism for the use of Explicit\r\nCongestion Notification (ECN) in TCP SYN\/ACK packets.\r\n\r\nThis document describes an optional, experimental modification to RFC\r\n3168 to allow TCP SYN\/ACK packets to be ECN-Capable.  For TCP, RFC\r\n3168 specifies setting an ECN-Capable codepoint on data packets, but\r\nnot on SYN and SYN\/ACK packets.  However, because of the high cost to\r\nthe TCP transfer of having a SYN\/ACK packet dropped, with the\r\nresulting retransmission timeout, this document describes the use of\r\nECN for the SYN\/ACK packet itself, when sent in response to a SYN\r\npacket with the two ECN flags set in the TCP header, indicating a\r\nwillingness to use ECN.  Setting the initial TCP SYN\/ACK packet as\r\nECN-Capable can be of great benefit to the TCP connection, avoiding\r\nthe severe penalty of a retransmission timeout for a connection that\r\nhas not yet started placing a load on the network.  The TCP responder\r\n(the sender of the SYN\/ACK packet) must reply to a report of an\r\nECN-marked SYN\/ACK packet by resending a SYN\/ACK packet that is not\r\nECN-Capable.  If the resent SYN\/ACK packet is acknowledged, then the\r\nTCP responder reduces its initial congestion window from two, three,\r\nor four segments to one segment, thereby reducing the subsequent load\r\nfrom that connection on the network.  If instead the SYN\/ACK packet is\r\ndropped, or for some other reason the TCP responder does not receive\r\nan acknowledgement in the specified time, the TCP responder follows\r\nTCP standards for a dropped SYN\/ACK packet (setting the retransmission\r\ntimer).  This memo defines an Experimental Protocol for the Internet community.","pub_date":"June 2009","keywords":["[--------]","ecn-capable"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5562","errata_url":null}