{"draft":"draft-ietf-pce-of-06","doc_id":"RFC5541","title":"Encoding of Objective Functions in the Path Computation Element Communication Protocol (PCEP)","authors":["JL. Le Roux","JP. Vasseur","Y. Lee"],"format":["ASCII","HTML"],"page_count":"23","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Path Computation Element","abstract":"The computation of one or a set of Traffic Engineering Label Switched\r\nPaths (TE LSPs) in MultiProtocol Label Switching (MPLS) and\r\nGeneralized MPLS (GMPLS) networks is subject to a set of one or more\r\nspecific optimization criteria, referred to as objective functions\r\n(e.g., minimum cost path, widest path, etc.).\r\n\r\nIn the Path Computation Element (PCE) architecture, a Path\r\nComputation Client (PCC) may want a path to be computed for one or\r\nmore TE LSPs according to a specific objective function.  Thus, the\r\nPCC needs to instruct the PCE to use the correct objective function.\r\nFurthermore, it is possible that not all PCEs support the same set of\r\nobjective functions; therefore, it is useful for the PCC to be able to\r\nautomatically discover the set of objective functions supported by\r\neach PCE.\r\n\r\nThis document defines extensions to the PCE communication Protocol\r\n(PCEP) to allow a PCE to indicate the set of objective functions it\r\nsupports.  Extensions are also defined so that a PCC can indicate in\r\na path computation request the required objective function, and\r\na PCE can report in a path computation reply the objective\r\nfunction that was used for path computation.\r\n\r\nThis document defines objective function code types for six\r\nobjective functions previously listed in the PCE requirements work,\r\nand provides the definition of four new metric types that apply to a\r\nset of synchronized requests.  [STANDARDS-TRACK]","pub_date":"June 2009","keywords":["[--------]","pcc","path computation client"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5541","errata_url":null}