{"draft":"draft-ietf-vrrp-unified-spec-05","doc_id":"RFC5798","title":"Virtual Router Redundancy Protocol (VRRP) Version 3 for IPv4 and IPv6","authors":["S. Nadas, Ed."],"format":["ASCII","HTML"],"page_count":"40","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Virtual Router Redundancy Protocol","abstract":"This memo defines the Virtual Router Redundancy Protocol (VRRP) for\r\nIPv4 and IPv6.  It is version three (3) of the protocol, and it is\r\nbased on VRRP (version 2) for IPv4 that is defined in RFC 3768 and in\r\n\"Virtual Router Redundancy Protocol for IPv6\".  VRRP specifies an election\r\nprotocol that dynamically assigns responsibility for a virtual router to one\r\nof the VRRP routers on a LAN.  The VRRP router controlling the IPv4 or IPv6\r\naddress(es) associated with a virtual router is called the Master, and it\r\nforwards packets sent to these IPv4 or IPv6 addresses.  VRRP Master routers\r\nare configured with virtual IPv4 or IPv6 addresses, and VRRP Backup routers\r\ninfer the address family of the virtual addresses being carried based on the\r\ntransport protocol.  Within a VRRP router, the virtual routers in each of the\r\nIPv4 and IPv6 address families are a domain unto themselves and do not\r\noverlap.  The election process provides dynamic failover in the forwarding\r\nresponsibility should the Master become unavailable.  For IPv4, the\r\nadvantage gained from using VRRP is a higher-availability default\r\npath without requiring configuration of dynamic routing or router\r\ndiscovery protocols on every end-host.  For IPv6, the advantage\r\ngained from using VRRP for IPv6 is a quicker switchover to Backup\r\nrouters than can be obtained with standard IPv6 Neighbor Discovery\r\nmechanisms.  [STANDARDS-TRACK]","pub_date":"March 2010","keywords":["[--------]"],"obsoletes":["RFC3768"],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5798","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5798"}