{"draft":"draft-ietf-roll-urban-routing-reqs-05","doc_id":"RFC5548","title":"Routing Requirements for Urban Low-Power and Lossy Networks","authors":["M. Dohler, Ed.","T. Watteyne, Ed.","T. Winter, Ed.","D. Barthel, Ed."],"format":["ASCII","HTML"],"page_count":"21","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Routing Over Low power and Lossy networks","abstract":"The application-specific routing requirements for Urban Low-Power and\r\nLossy Networks (U-LLNs) are presented in this document.  In the near\r\nfuture, sensing and actuating nodes will be placed outdoors in urban\r\nenvironments so as to improve people's living conditions as well as\r\nto monitor compliance with increasingly strict environmental laws.\r\nThese field nodes are expected to measure and report a wide gamut of\r\ndata (for example, the data required by applications that perform\r\nsmart-metering or that monitor meteorological, pollution, and allergy\r\nconditions).  The majority of these nodes are expected to communicate\r\nwirelessly over a variety of links such as IEEE 802.15.4, low-power\r\nIEEE 802.11, or IEEE 802.15.1 (Bluetooth), which given the limited\r\nradio range and the large number of nodes requires the use of\r\nsuitable routing protocols.  The design of such protocols will be\r\nmainly impacted by the limited resources of the nodes (memory,\r\nprocessing power, battery, etc.) and the particularities of the\r\noutdoor urban application scenarios.  As such, for a wireless\r\nsolution for Routing Over Low-Power and Lossy (ROLL) networks to be\r\nuseful, the protocol(s) ought to be energy-efficient, scalable, and\r\nautonomous.  This documents aims to specify a set of IPv6 routing\r\nrequirements reflecting these and further U-LLNs' tailored\r\ncharacteristics.  This memo provides information for the Internet community.","pub_date":"May 2009","keywords":["u-lln","roll","routing over low-power and loss"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5548","errata_url":null}