{"draft":"draft-ietf-ospf-ospfv3-update-23","doc_id":"RFC5340","title":"OSPF for IPv6","authors":["R. Coltun","D. Ferguson","J. Moy","A. Lindem"],"format":["ASCII","HTML"],"page_count":"94","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Open Shortest Path First IGP","abstract":"This document describes the modifications to OSPF to support version\r\n6 of the Internet Protocol (IPv6).  The fundamental mechanisms of\r\nOSPF (flooding, Designated Router (DR) election, area support, Short\r\nPath First (SPF) calculations, etc.) remain unchanged.  However, some\r\nchanges have been necessary, either due to changes in protocol\r\nsemantics between IPv4 and IPv6, or simply to handle the increased\r\naddress size of IPv6.  These modifications will necessitate\r\nincrementing the protocol version from version 2 to version 3.  OSPF\r\nfor IPv6 is also referred to as OSPF version 3 (OSPFv3).\r\n\r\nChanges between OSPF for IPv4, OSPF Version 2, and OSPF for IPv6 as\r\ndescribed herein include the following.  Addressing semantics have\r\nbeen removed from OSPF packets and the basic Link State\r\nAdvertisements (LSAs).  New LSAs have been created to carry IPv6\r\naddresses and prefixes.  OSPF now runs on a per-link basis rather\r\nthan on a per-IP-subnet basis.  Flooding scope for LSAs has been\r\ngeneralized.  Authentication has been removed from the OSPF protocol\r\nand instead relies on IPv6's Authentication Header and Encapsulating\r\nSecurity Payload (ESP).\r\n\r\nEven with larger IPv6 addresses, most packets in OSPF for IPv6 are\r\nalmost as compact as those in OSPF for IPv4.  Most fields and packet-\r\nsize limitations present in OSPF for IPv4 have been relaxed.  In\r\naddition, option handling has been made more flexible.\r\n\r\nAll of OSPF for IPv4's optional capabilities, including demand\r\ncircuit support and Not-So-Stubby Areas (NSSAs), are also supported\r\nin OSPF for IPv6.  [STANDARDS-TRACK]","pub_date":"July 2008","keywords":["[--------]","open shortest path first","ospfv3"],"obsoletes":["RFC2740"],"obsoleted_by":[],"updates":[],"updated_by":["RFC6845","RFC6860","RFC7503","RFC8362","RFC9454"],"see_also":[],"doi":"10.17487\/RFC5340","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5340"}