{"draft":"draft-ietf-rmt-pi-norm-revised-14","doc_id":"RFC5740","title":"NACK-Oriented Reliable Multicast (NORM) Transport Protocol","authors":["B. Adamson","C. Bormann","M. Handley","J. Macker"],"format":["ASCII","HTML"],"page_count":"96","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Reliable Multicast Transport","abstract":"This document describes the messages and procedures of the Negative-\r\nACKnowledgment (NACK) Oriented Reliable Multicast (NORM) protocol.\r\nThis protocol can provide end-to-end reliable transport of bulk data\r\nobjects or streams over generic IP multicast routing and forwarding\r\nservices.  NORM uses a selective, negative acknowledgment mechanism\r\nfor transport reliability and offers additional protocol mechanisms\r\nto allow for operation with minimal a priori coordination among\r\nsenders and receivers.  A congestion control scheme is specified to\r\nallow the NORM protocol to fairly share available network bandwidth\r\nwith other transport protocols such as Transmission Control Protocol\r\n(TCP).  It is capable of operating with both reciprocal multicast\r\nrouting among senders and receivers and with asymmetric connectivity\r\n(possibly a unicast return path) between the senders and receivers.\r\nThe protocol offers a number of features to allow different types of\r\napplications or possibly other higher-level transport protocols to\r\nutilize its service in different ways.  The protocol leverages the\r\nuse of FEC-based (forward error correction) repair and other IETF\r\nReliable Multicast Transport (RMT) building blocks in its design.\r\nThis document obsoletes RFC 3940.  [STANDARDS-TRACK]","pub_date":"November 2009","keywords":["[--------]","multicast","reliable multicast","transport","negative-acknowledgment","forward error correction","packet erasure coding","group communication"],"obsoletes":["RFC3940"],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC5740","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5740"}