{"draft":"draft-ietf-ccamp-rfc4420bis-03","doc_id":"RFC5420","title":"Encoding of Attributes for MPLS LSP Establishment Using Resource Reservation Protocol Traffic Engineering (RSVP-TE)","authors":["A. Farrel, Ed.","D. Papadimitriou","JP. Vasseur","A. Ayyangar"],"format":["ASCII","HTML"],"page_count":"22","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Common Control and Measurement Plane","abstract":"Multiprotocol Label Switching (MPLS) Label Switched Paths (LSPs) may\r\nbe established using the Resource Reservation Protocol Traffic\r\nEngineering (RSVP-TE) extensions.  This protocol includes an object\r\n(the SESSION_ATTRIBUTE object) that carries a Flags field used to\r\nindicate options and attributes of the LSP.  That Flags field has\r\neight bits, allowing for eight options to be set.  Recent proposals in\r\nmany documents that extend RSVP-TE have suggested uses for each of\r\nthe previously unused bits.\r\n\r\nThis document defines a new object for RSVP-TE messages that allows\r\nthe signaling of further attribute bits and also the carriage of\r\narbitrary attribute parameters to make RSVP-TE easily extensible to\r\nsupport new requirements.  Additionally, this document defines a way\r\nto record the attributes applied to the LSP on a hop-by-hop basis.\r\n\r\nThe object mechanisms defined in this document are equally applicable\r\nto Generalized MPLS (GMPLS) Packet Switch Capable (PSC) LSPs and to\r\nGMPLS non-PSC LSPs.\r\n\r\nThis document replaces and obsoletes the previous version of this\r\nwork, published as RFC 4420.  The only change is in the encoding of the\r\nType-Length-Variable (TLV) data structures.  [STANDARDS-TRACK]","pub_date":"February 2009","keywords":["[--------]","multiprotocol label switching","label switched paths","SESSION_ATTRIBUTE"],"obsoletes":["RFC4420"],"obsoleted_by":[],"updates":["RFC3209","RFC3473"],"updated_by":["RFC6510"],"see_also":[],"doi":"10.17487\/RFC5420","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5420"}