{"draft":"draft-ietf-mmusic-sdp-capability-negotiation-13","doc_id":"RFC5939","title":"Session Description Protocol (SDP) Capability Negotiation","authors":["F. Andreasen"],"format":["ASCII","HTML"],"page_count":"77","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Multiparty Multimedia Session Control RAI","abstract":"The Session Description Protocol (SDP) was intended to describe\r\nmultimedia sessions for the purposes of session announcement, session\r\ninvitation, and other forms of multimedia session initiation.  SDP was\r\nnot intended to provide capability indication or capability\r\nnegotiation; however, over the years, SDP has seen widespread adoption\r\nand as a result it has been gradually extended to provide limited\r\nsupport for these, notably in the form of the offer\/answer model\r\ndefined in RFC 3264.  SDP does not define how to negotiate one or more\r\nalternative transport protocols (e.g., RTP profiles) or\r\nattributes.  This makes it difficult to deploy new RTP profiles such as\r\nSecure RTP or RTP with RTCP-based feedback,\r\nnegotiate use of different security keying mechanisms, etc.  It also\r\npresents problems for some forms of media negotiation.\r\n\r\nThe purpose of this document is to address these shortcomings by\r\nextending SDP with capability negotiation parameters and associated\r\noffer\/answer procedures to use those parameters in a backwards\r\ncompatible manner.\r\n\r\nThe document defines a general SDP Capability Negotiation framework.\r\nIt also specifies how to provide attributes and transport protocols\r\nas capabilities and negotiate them using the framework.  Extensions\r\nfor other types of capabilities (e.g., media types and media formats)\r\nmay be provided in other documents.  [STANDARDS-TRACK]","pub_date":"September 2010","keywords":["[--------]","multimedia session","session announcement","session invitation"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC6871"],"see_also":[],"doi":"10.17487\/RFC5939","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc5939"}