{"draft":"draft-ietf-mpls-tp-framework-12","doc_id":"RFC5921","title":"A Framework for MPLS in Transport Networks","authors":["M. Bocci, Ed.","S. Bryant, Ed.","D. Frost, Ed.","L. Levrau","L. Berger"],"format":["ASCII","HTML"],"page_count":"56","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Multiprotocol Label Switching","abstract":"This document specifies an architectural framework for the\r\napplication of Multiprotocol Label Switching (MPLS) to the\r\nconstruction of packet-switched transport networks.  It describes a\r\ncommon set of protocol functions -- the MPLS Transport Profile\r\n(MPLS-TP) -- that supports the operational models and capabilities\r\ntypical of such networks, including signaled or explicitly\r\nprovisioned bidirectional connection-oriented paths, protection and\r\nrestoration mechanisms, comprehensive Operations, Administration, and\r\nMaintenance (OAM) functions, and network operation in the absence of\r\na dynamic control plane or IP forwarding support.  Some of these\r\nfunctions are defined in existing MPLS specifications, while others\r\nrequire extensions to existing specifications to meet the\r\nrequirements of the MPLS-TP.\r\n\r\nThis document defines the subset of the MPLS-TP applicable in general\r\nand to point-to-point transport paths.  The remaining subset,\r\napplicable specifically to point-to-multipoint transport paths, is\r\noutside the scope of this document.\r\n\r\nThis document is a product of a joint Internet Engineering Task Force\r\n(IETF) \/ International Telecommunication Union Telecommunication\r\nStandardization Sector (ITU-T) effort to include an MPLS Transport\r\nProfile within the IETF MPLS and Pseudowire Emulation Edge-to-Edge\r\n(PWE3) architectures to support the capabilities and functionalities\r\nof a packet transport network as defined by the ITU-T.  This document \r\nis not an Internet Standards Track specification; it is published for \r\ninformational purposes.","pub_date":"July 2010","keywords":["multiprotocol label switching","mpls-tp","transport profile","oam","itu-t"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC6215","RFC7274"],"see_also":[],"doi":"10.17487\/RFC5921","errata_url":null}