{"draft":"draft-ietf-mptcp-congestion-07","doc_id":"RFC6356","title":"Coupled Congestion Control for Multipath Transport Protocols","authors":["C. Raiciu","M. Handley","D. Wischik"],"format":["ASCII","HTML"],"page_count":"12","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Multipath TCP","abstract":"Often endpoints are connected by multiple paths, but communications\r\nare usually restricted to a single path per connection.  Resource\r\nusage within the network would be more efficient were it possible for\r\nthese multiple paths to be used concurrently.  Multipath TCP is a\r\nproposal to achieve multipath transport in TCP.\r\n\r\nNew congestion control algorithms are needed for multipath transport\r\nprotocols such as Multipath TCP, as single path algorithms have a\r\nseries of issues in the multipath context.  One of the prominent\r\nproblems is that running existing algorithms such as standard TCP\r\nindependently on each path would give the multipath flow more than\r\nits fair share at a bottleneck link traversed by more than one of its\r\nsubflows.  Further, it is desirable that a source with multiple paths\r\navailable will transfer more traffic using the least congested of the\r\npaths, achieving a property called \"resource pooling\" where a bundle\r\nof links effectively behaves like one shared link with bigger\r\ncapacity.  This would increase the overall efficiency of the network\r\nand also its robustness to failure.\r\n\r\nThis document presents a congestion control algorithm that couples\r\nthe congestion control algorithms running on different subflows by\r\nlinking their increase functions, and dynamically controls the\r\noverall aggressiveness of the multipath flow.  The result is a\r\npractical algorithm that is fair to TCP at bottlenecks while moving\r\ntraffic away from congested links.  This document defines an Experimental \r\nProtocol for the Internet community.","pub_date":"October 2011","keywords":["multipath","tcp","congestion control"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6356","errata_url":null}