{"draft":"draft-li-pwe3-ms-pw-pon-06","doc_id":"RFC6456","title":"Multi-Segment Pseudowires in Passive Optical Networks","authors":["H. Li","R. Zheng","A. Farrel"],"format":["ASCII","HTML"],"page_count":"12","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"IETF - NON WORKING GROUP","abstract":"This document describes the application of MPLS multi-segment\r\npseudowires (MS-PWs) in a dual-technology environment comprising a\r\nPassive Optical Network (PON) and an MPLS Packet Switched Network\r\n(PSN).\r\n\r\nPON technology may be used in mobile backhaul networks to support the\r\nend segments closest to the aggregation devices.  In these cases,\r\nthere may be a very large number of pseudowire (PW) Terminating\r\nProvider Edge (T-PE) nodes.  The MPLS control plane could be used to\r\nprovision these end segments, but support for the necessary protocols\r\nwould complicate the management of the T-PEs and would significantly\r\nincrease their expense.  Alternatively, static, or management plane,\r\nconfiguration could be used to configure the end segments, but the\r\nvery large number of such segments in a PON places a very heavy\r\nburden on the network manager.\r\n\r\nThis document describes how to set up the end segment of an end-to-\r\nend MPLS PW over a Gigabit-capable Passive Optical Network (G-PON) or\r\n10 Gigabit-capable Passive Optical Network (XG-PON) using the G-PON\r\nand XG-PON management protocol, Optical Network Termination\r\nManagement and Control Interface (OMCI).  This simplifies and speeds\r\nup PW provisioning compared with manual configuration.\r\n\r\nThis document also shows how an MS-PW may be constructed from an end\r\nsegment supported over a PON, and switched to one or more segments\r\nsupported over an MPLS PSN.  This document is not an Internet Standards \r\nTrack specification; it is published for informational purposes.","pub_date":"November 2011","keywords":["MPLS","PSN","PON","G-PON","XG-PON","OMCI"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6456","errata_url":null}