{"draft":"draft-ietf-rtgwg-ordered-fib-12","doc_id":"RFC6976","title":"Framework for Loop-Free Convergence Using the Ordered Forwarding Information Base (oFIB) Approach","authors":["M. Shand","S. Bryant","S. Previdi","C. Filsfils","P. Francois","O. Bonaventure"],"format":["ASCII","HTML"],"page_count":"28","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Routing Area Working Group","abstract":"This document describes an illustrative framework of a mechanism for\r\nuse in conjunction with link-state routing protocols that prevents\r\nthe transient loops that would otherwise occur during topology\r\nchanges.  It does this by correctly sequencing the forwarding\r\ninformation base (FIB) updates on the routers.\r\n\r\nThis mechanism can be used in the case of non-urgent (management\r\naction) link or node shutdowns and restarts or link metric changes.\r\nIt can also be used in conjunction with a fast reroute mechanism that\r\nconverts a sudden link or node failure into a non-urgent topology\r\nchange.  This is possible where a complete repair path is provided\r\nfor all affected destinations.\r\n\r\nAfter a non-urgent topology change, each router computes a rank that\r\ndefines the time at which it can safely update its FIB.  A method for\r\naccelerating this loop-free convergence process by the use of\r\ncompletion messages is also described.\r\n\r\nThe technology described in this document has been subject to\r\nextensive simulation using pathological convergence behavior and real\r\nnetwork topologies and costs.  However, the mechanisms described in\r\nthis document are purely illustrative of the general approach and do\r\nnot constitute a protocol specification.  This document represents a\r\nsnapshot of the work of the Routing Area Working Group at the time of\r\npublication and is published as a document of record.  Further work\r\nis needed before implementation or deployment.","pub_date":"July 2013","keywords":[],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6976","errata_url":null}