{"draft":"draft-ietf-pcn-3-in-1-encoding-11","doc_id":"RFC6660","title":"Encoding Three Pre-Congestion Notification (PCN) States in the IP Header Using a Single Diffserv Codepoint (DSCP)","authors":["B. Briscoe","T. Moncaster","M. Menth"],"format":["ASCII","HTML"],"page_count":"24","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Congestion and Pre-Congestion Notification","abstract":"The objective of Pre-Congestion Notification (PCN) is to protect the\r\nquality of service (QoS) of inelastic flows within a Diffserv domain.\r\nThe overall rate of PCN-traffic is metered on every link in the PCN-\r\ndomain, and PCN-packets are appropriately marked when certain\r\nconfigured rates are exceeded.  Egress nodes pass information about\r\nthese PCN-marks to Decision Points that then decide whether to admit\r\nor block new flow requests or to terminate some already admitted\r\nflows during serious pre-congestion.\r\n\r\nThis document specifies how PCN-marks are to be encoded into the IP\r\nheader by reusing the Explicit Congestion Notification (ECN)\r\ncodepoints within a PCN-domain.  The PCN wire protocol for non-IP\r\nprotocol headers will need to be defined elsewhere.  Nonetheless,\r\nthis document clarifies the PCN encoding for MPLS in an informational\r\nappendix.  The encoding for IP provides for up to three different PCN\r\nmarking states using a single Diffserv codepoint (DSCP): not-marked\r\n(NM), threshold-marked (ThM), and excess-traffic-marked (ETM).\r\nHence, it is called the 3-in-1 PCN encoding.  This document obsoletes\r\nRFC 5696.  [STANDARDS-TRACK]","pub_date":"July 2012","keywords":["[--------]","Quality of Service","QoS","Congestion Control","Congestion Notification","Tunnelling","Encapsulation & Decapsulation","Differentiated Services","Integrated Services","Signalling","Protocol","Flow Admission Control","Flow Termination"],"obsoletes":["RFC5696"],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6660","errata_url":null}