{"draft":"draft-ietf-dime-nat-control-17","doc_id":"RFC6736","title":"Diameter Network Address and Port Translation Control Application","authors":["F. Brockners","S. Bhandari","V. Singh","V. Fajardo"],"format":["ASCII","HTML"],"page_count":"58","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Diameter Maintenance and Extensions","abstract":"This document describes the framework, messages, and procedures for\r\nthe Diameter Network address and port translation Control\r\nApplication.  This Diameter application allows per-endpoint control\r\nof Network Address Translators and Network Address and Port\r\nTranslators, which are added to networks to cope with IPv4 address\r\nspace depletion.  This Diameter application allows external devices\r\nto configure and manage a Network Address Translator device --\r\nexpanding the existing Diameter-based Authentication, Authorization,\r\nand Accounting (AAA) and policy control capabilities with a Network\r\nAddress Translator and Network Address and Port Translator control\r\ncomponent.  These external devices can be network elements in the\r\ndata plane such as a Network Access Server, or can be more\r\ncentralized control plane devices such as AAA-servers.  This Diameter\r\napplication establishes a context to commonly identify and manage\r\nendpoints on a gateway or server and a Network Address Translator and\r\nNetwork Address and Port Translator device.  This includes, for\r\nexample, the control of the total number of Network Address\r\nTranslator bindings allowed or the allocation of a specific Network\r\nAddress Translator binding for a particular endpoint.  In addition,\r\nit allows Network Address Translator devices to provide information\r\nrelevant to accounting purposes.  [STANDARDS-TRACK]","pub_date":"October 2012","keywords":["[--------]","NAT control","NAT44","NAT66","CGN","BNG"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6736","errata_url":null}