{"draft":"draft-ietf-speermint-voipthreats-09","doc_id":"RFC6404","title":"Session PEERing for Multimedia INTerconnect (SPEERMINT) Security Threats and Suggested Countermeasures","authors":["J. Seedorf","S. Niccolini","E. Chen","H. Scholz"],"format":["ASCII","HTML"],"page_count":"22","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Session PEERing for Multimedia INTerconnect","abstract":"The Session PEERing for Multimedia INTerconnect (SPEERMINT) working\r\ngroup (WG) provides a peering framework that leverages the building\r\nblocks of existing IETF-defined protocols such as SIP and ENUM for\r\nthe interconnection between SIP Service Providers (SSPs).  The\r\nobjective of this document is to identify and enumerate SPEERMINT-\r\nspecific threat vectors and to give guidance for implementers on\r\nselecting appropriate countermeasures.  Security requirements for\r\nSPEERMINT that have been derived from the threats detailed in this\r\ndocument can be found in RFC 6271; this document provides concrete\r\ncountermeasures to meet those SPEERMINT security requirements.  In\r\nthis document, the different security threats related to SPEERMINT\r\nare classified into threats to the Lookup Function (LUF), the\r\nLocation Routing Function (LRF), the Signaling Function (SF), and the\r\nMedia Function (MF) of a specific SIP Service Provider.  Various\r\ninstances of the threats are briefly introduced inside the\r\nclassification.  Finally, existing security solutions for SIP and\r\nRTP\/RTCP (Real-time Transport Control Protocol) are presented to\r\ndescribe countermeasures currently available for such threats.  Each\r\nSSP may have connections to one or more remote SSPs through peering\r\nor transit contracts.  A potentially compromised remote SSP that\r\nattacks other SSPs is out of the scope of this document; this\r\ndocument focuses on attacks on an SSP from outside the trust domain\r\nsuch an SSP may have with other SSPs.  This document is not an Internet \r\nStandards Track specification; it is published for informational purposes.","pub_date":"November 2011","keywords":["VoIP","Security","Threats","multimedia","Threat countermeasures","SIP Interconnect","VoIP peering","Fraud prevention","Network protection","SIP","RTP","RTCP","control plane","user plane"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6404","errata_url":null}