{"draft":"draft-ietf-mpls-tp-survive-fwk-06","doc_id":"RFC6372","title":"MPLS Transport Profile (MPLS-TP) Survivability Framework","authors":["N. Sprecher, Ed.","A. Farrel, Ed."],"format":["ASCII","HTML"],"page_count":"56","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Multiprotocol Label Switching","abstract":"Network survivability is the ability of a network to recover traffic\r\ndelivery following failure or degradation of network\r\nresources.  Survivability is critical for the delivery of guaranteed\r\nnetwork services, such as those subject to strict Service Level\r\nAgreements (SLAs) that place maximum bounds on the length of time\r\nthat services may be degraded or unavailable.\r\n\r\nThe Transport Profile of Multiprotocol Label Switching (MPLS-TP) is a\r\npacket-based transport technology based on the MPLS data plane that\r\nreuses many aspects of the MPLS management and control planes.\r\n\r\nThis document comprises a framework for the provision of survivability\r\nin an MPLS-TP network; it describes recovery elements, types, methods,\r\nand topological considerations.  To enable data-plane recovery,\r\nsurvivability may be supported by the control plane, management plane,\r\nand by Operations, Administration, and Maintenance (OAM) functions.\r\nThis document describes mechanisms for recovering MPLS-TP Label\r\nSwitched Paths (LSPs).  A detailed description of pseudowire recovery\r\nin MPLS-TP networks is beyond the scope of this document.\r\n\r\nThis document is a product of a joint Internet Engineering Task Force\r\n(IETF) \/ International Telecommunication Union Telecommunication\r\nStandardization Sector (ITU-T) effort to include an MPLS Transport\r\nProfile within the IETF MPLS and Pseudowire Emulation Edge-to-Edge (PWE3)\r\narchitectures to support the capabilities and functionalities of a\r\npacket-based transport network as defined by the ITU-T.  \r\n\r\nThis document is not an Internet Standards Track specification; it is\r\npublished for informational purposes.","pub_date":"September 2011","keywords":["Protection","Restoration","Recovery"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6372","errata_url":null}