{"draft":"draft-gellens-mime-bucket-bis-09","doc_id":"RFC6381","title":"The 'Codecs' and 'Profiles' Parameters for \"Bucket\" Media Types","authors":["R. Gellens","D. Singer","P. Frojdh"],"format":["ASCII","HTML"],"page_count":"19","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"IETF - NON WORKING GROUP","abstract":"Several MIME type\/subtype combinations exist that can contain\r\ndifferent media formats.  A receiving agent thus needs to examine the\r\ndetails of such media content to determine if the specific elements\r\ncan be rendered given an available set of codecs.  Especially when\r\nthe end system has limited resources, or the connection to the end\r\nsystem has limited bandwidth, it is helpful to know from the Content-\r\nType alone if the content can be rendered.\r\n\r\nThis document specifies two parameters, 'codecs' and 'profiles', that\r\nare used with various MIME types or type\/subtype combinations to\r\nallow for unambiguous specification of the codecs employed by the\r\nmedia formats contained within, or the profile(s) of the overall\r\ncontainer format.  This document obsoletes RFC 4281; RFC 4281 defines\r\nthe 'codecs' parameter, which this document retains in a backwards\r\ncompatible manner with minor clarifications; the 'profiles' parameter\r\nis added by this document.\r\n\r\nBy labeling content with the specific codecs indicated to render the\r\ncontained media, receiving systems can determine if the codecs are\r\nsupported by the end system, and if not, can take appropriate action\r\n(such as rejecting the content, sending notification of the\r\nsituation, transcoding the content to a supported type, fetching and\r\ninstalling the required codecs, further inspection to determine if it\r\nwill be sufficient to support a subset of the indicated codecs,\r\netc.).\r\n\r\nSimilarly, the profiles can provide an overall indication, to the\r\nreceiver, of the specifications with which the content complies.\r\nThis is an indication of the compatibility of the container format\r\nand its contents to some specification.  The receiver may be able to\r\nwork out the extent to which it can handle and render the content by\r\nexamining to see which of the declared profiles it supports, and what\r\nthey mean.  [STANDARDS-TRACK]","pub_date":"August 2011","keywords":["[--------]","codec","container","audio","video","3gpp","3gpp2"],"obsoletes":["RFC4281"],"obsoleted_by":[],"updates":["RFC3839","RFC4393","RFC4337"],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6381","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc6381"}