{"draft":"draft-irtf-mobopts-mpa-framework-09","doc_id":"RFC6252","title":"A Framework of Media-Independent Pre-Authentication (MPA) for Inter-Domain Handover Optimization","authors":["A. Dutta, Ed.","V. Fajardo","Y. Ohba","K. Taniuchi","H. Schulzrinne"],"format":["ASCII","HTML"],"page_count":"57","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"IRTF","abstract":"This document describes Media-independent Pre-Authentication (MPA), a\r\nnew handover optimization mechanism that addresses the issues on\r\nexisting mobility management protocols and mobility optimization\r\nmechanisms to support inter-domain handover.  MPA is a mobile-\r\nassisted, secure handover optimization scheme that works over any\r\nlink layer and with any mobility management protocol, and is most\r\napplicable to supporting optimization during inter-domain handover.\r\nMPA's pre-authentication, pre-configuration, and proactive handover\r\ntechniques allow many of the handoff-related operations to take place\r\nbefore the mobile node has moved to the new network.  We describe the\r\ndetails of all the associated techniques and their applicability for\r\ndifferent scenarios involving various mobility protocols during\r\ninter-domain handover.  We have implemented the MPA mechanism for\r\nvarious network-layer and application-layer mobility protocols, and\r\nwe report a summary of experimental performance results in this\r\ndocument.\r\n\r\nThis document is a product of the IP Mobility Optimizations (MOBOPTS)\r\nResearch Group.  This document is not an Internet Standards Track \r\nspecification; it is published for informational purposes.","pub_date":"June 2011","keywords":["Mobility","Optimization","Proactive handoff","Link-layer security","Handover taxonomy","Layer 2 handoff","Layer 3 handoff","Network discovery","Handover delay","Packet loss","Proactive binding update","Multi-interface","IP address acquisition","Tunnel management"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6252","errata_url":null}