{"draft":"draft-shiomoto-ccamp-switch-programming-05","doc_id":"RFC6383","title":"Advice on When It Is Safe to Start Sending Data on Label Switched Paths Established Using RSVP-TE","authors":["K. Shiomoto","A. Farrel"],"format":["ASCII","HTML"],"page_count":"11","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"IETF - NON WORKING GROUP","abstract":"The Resource Reservation Protocol (RSVP) has been extended to support\r\nTraffic Engineering (TE) in Multiprotocol Label Switching (MPLS) and\r\nGeneralized MPLS (GMPLS) networks.  The protocol enables signaling\r\nexchanges to establish Label Switched Paths (LSPs) that traverse\r\nnodes and link to provide end-to-end data paths.  Each node is\r\nprogrammed with \"cross-connect\" information as the signaling messages\r\nare processed.  The cross-connection information instructs the node\r\nhow to forward data that it receives.\r\n\r\nEnd points of an LSP need to know when it is safe to start sending\r\ndata so that it is not misdelivered, and so that safety issues\r\nspecific to optical data-plane technology are satisfied.  Likewise,\r\nall label switching routers along the path of the LSP need to know\r\nwhen to program their data planes relative to sending and receiving\r\ncontrol-plane messages.\r\n\r\nThis document clarifies and summarizes the RSVP-TE protocol exchanges\r\nwith relation to the programming of cross-connects along an LSP for\r\nboth unidirectional and bidirectional LSPs.  This document does not\r\ndefine any new procedures or protocol extensions, and defers\r\ncompletely to the documents that provide normative references.  The\r\nclarifications set out in this document may also be used to help\r\ninterpret LSP establishment performance figures for MPLS-TE and GMPLS\r\ndevices.  This document is not an Internet Standards Track specification; \r\nit is\r\npublished for informational purposes.","pub_date":"September 2011","keywords":["RSVP-TE","GMPLS","MPLS-TE","cross-connect","data plane"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC6383","errata_url":null}