{"draft":"draft-ietf-teas-interconnected-te-info-exchange-07","doc_id":"RFC7926","title":"Problem Statement and Architecture for Information Exchange between Interconnected Traffic-Engineered Networks","authors":["A. Farrel, Ed.","J. Drake","N. Bitar","G. Swallow","D. Ceccarelli","X. Zhang"],"format":["ASCII","HTML"],"page_count":"67","pub_status":"BEST CURRENT PRACTICE","status":"BEST CURRENT PRACTICE","source":"Traffic Engineering Architecture and Signaling","abstract":"In Traffic-Engineered (TE) systems, it is sometimes desirable to\r\nestablish an end-to-end TE path with a set of constraints (such as\r\nbandwidth) across one or more networks from a source to a\r\ndestination.  TE information is the data relating to nodes and TE\r\nlinks that is used in the process of selecting a TE path.  TE\r\ninformation is usually only available within a network.  We call such\r\na zone of visibility of TE information a domain.  An example of a\r\ndomain may be an IGP area or an Autonomous System.\r\n\r\nIn order to determine the potential to establish a TE path through a\r\nseries of connected networks, it is necessary to have available a\r\ncertain amount of TE information about each network.  This need not\r\nbe the full set of TE information available within each network but\r\ndoes need to express the potential of providing TE connectivity.\r\nThis subset of TE information is called TE reachability information.\r\n\r\nThis document sets out the problem statement for the exchange of TE\r\ninformation between interconnected TE networks in support of\r\nend-to-end TE path establishment and describes the best current\r\npractice architecture to meet this problem statement.  For reasons\r\nthat are explained in this document, this work is limited to simple\r\nTE constraints and information that determine TE reachability.","pub_date":"July 2016","keywords":["Abstract link","Abstract node","Abstraction","Abstraction layer","Aggregation","Virtual node","Virtual link"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":["BCP0206"],"doi":"10.17487\/RFC7926","errata_url":null}