{"draft":"draft-ietf-alto-protocol-27","doc_id":"RFC7285","title":"Application-Layer Traffic Optimization (ALTO) Protocol","authors":["R. Alimi, Ed.","R. Penno, Ed.","Y. Yang, Ed.","S. Kiesel","S. Previdi","W. Roome","S. Shalunov","R. Woundy"],"format":["ASCII","HTML"],"page_count":"91","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Application-Layer Traffic Optimization","abstract":"Applications using the Internet already have access to some topology\r\ninformation of Internet Service Provider (ISP) networks.  For\r\nexample, views to Internet routing tables at Looking Glass servers\r\nare available and can be practically downloaded to many network\r\napplication clients.  What is missing is knowledge of the underlying\r\nnetwork topologies from the point of view of ISPs.  In other words,\r\nwhat an ISP prefers in terms of traffic optimization -- and a way to\r\ndistribute it.\r\n\r\nThe Application-Layer Traffic Optimization (ALTO) services defined in\r\nthis document provide network information (e.g., basic network\r\nlocation structure and preferences of network paths) with the goal of\r\nmodifying network resource consumption patterns while maintaining or\r\nimproving application performance.  The basic information of ALTO is\r\nbased on abstract maps of a network.  These maps provide a simplified\r\nview, yet enough information about a network for applications to\r\neffectively utilize them.  Additional services are built on top of\r\nthe maps.\r\n\r\nThis document describes a protocol implementing the ALTO services.\r\nAlthough the ALTO services would primarily be provided by ISPs, other\r\nentities, such as content service providers, could also provide ALTO\r\nservices.  Applications that could use the ALTO services are those\r\nthat have a choice to which end points to connect.  Examples of such\r\napplications are peer-to-peer (P2P) and content delivery networks.","pub_date":"September 2014","keywords":["ALTO Information Resources","Network Map","PID","Filtered Network Map","Cost Map","Endpoint Property Service","Endpoint Cost Service"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC9274"],"see_also":[],"doi":"10.17487\/RFC7285","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc7285"}