{"draft":"draft-ietf-ecrit-car-crash-23","doc_id":"RFC8148","title":"Next-Generation Vehicle-Initiated Emergency Calls","authors":["R. Gellens","B. Rosen","H. Tschofenig"],"format":["ASCII","HTML"],"page_count":"40","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Emergency Context Resolution with Internet Technologies","abstract":"This document describes how to use IP-based emergency services\r\nmechanisms to support the next generation of emergency calls placed\r\nby vehicles (automatically in the event of a crash or serious\r\nincident, or manually invoked by a vehicle occupant) and conveying\r\nvehicle, sensor, and location data related to the crash or incident.\r\nSuch calls are often referred to as \"Automatic Crash Notification\"\r\n(ACN), or \"Advanced Automatic Crash Notification\" (AACN), even in the\r\ncase of manual trigger.  The \"Advanced\" qualifier refers to the\r\nability to carry a richer set of data.\r\n\r\nThis document also registers a MIME media type and Emergency Call\r\nData Type for the vehicle, sensor, and location data (often referred\r\nto as \"crash data\" even though there is not necessarily a crash) and\r\nan INFO package to enable carrying this and related data in SIP INFO\r\nrequests.  An external specification for the data format, contents,\r\nand structure is referenced in this document.\r\n\r\nThis document reuses the technical aspects of next-generation Pan-\r\nEuropean eCall (a mandated and standardized system for emergency\r\ncalls by in-vehicle systems (IVSs) within Europe and other regions).\r\nHowever, this document specifies use of a different set of vehicle\r\n(crash) data, specifically, the Vehicle Emergency Data Set (VEDS)\r\nrather than the eCall Minimum Set of Data (MSD).  This document is an\r\nextension of the IETF eCall document, with the primary differences\r\nbeing that this document makes the MSD data set optional and VEDS\r\nmandatory, and it adds attribute values to the metadata\/control\r\nobject to permit greater functionality.  This document registers a\r\nnew INFO package (identical to that registered for eCall but with the\r\naddition of the VEDS MIME type).  This document also describes legacy\r\n(circuit-switched) ACN systems and their migration to next-generation\r\nemergency calling, to provide background information and context.","pub_date":"May 2017","keywords":["emergency","call","calls","emergency call","emergency calls","vehicle","acn","aacn","automatic crash notification","automatic collision notification","advanced automatic crash notification","advanced automatic collision notification","crash","vehicle-initiated","ecall"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8148","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc8148"}