{"draft":"draft-ietf-ippm-model-based-metrics-13","doc_id":"RFC8337","title":"Model-Based Metrics for Bulk Transport Capacity","authors":["M. Mathis","A. Morton"],"format":["ASCII","HTML"],"page_count":"55","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"IP Performance Measurement","abstract":"This document introduces a new class of Model-Based Metrics designed\r\nto assess if a complete Internet path can be expected to meet a\r\npredefined Target Transport Performance by applying a suite of IP\r\ndiagnostic tests to successive subpaths.  The subpath-at-a-time tests\r\ncan be robustly applied to critical infrastructure, such as network\r\ninterconnections or even individual devices, to accurately detect if\r\nany part of the infrastructure will prevent paths traversing it from\r\nmeeting the Target Transport Performance.\r\n\r\nModel-Based Metrics rely on mathematical models to specify a Targeted\r\nIP Diagnostic Suite, a set of IP diagnostic tests designed to assess\r\nwhether common transport protocols can be expected to meet a\r\npredetermined Target Transport Performance over an Internet path.\r\n\r\nFor Bulk Transport Capacity, the IP diagnostics are built using test\r\nstreams and statistical criteria for evaluating the packet transfer\r\nthat mimic TCP over the complete path.  The temporal structure of the\r\ntest stream (e.g., bursts) mimics TCP or other transport protocols\r\ncarrying bulk data over a long path.  However, they are constructed\r\nto be independent of the details of the subpath under test, end\r\nsystems, or applications.  Likewise, the success criteria evaluates\r\nthe packet transfer statistics of the subpath against criteria\r\ndetermined by protocol performance models applied to the Target\r\nTransport Performance of the complete path.  The success criteria\r\nalso does not depend on the details of the subpath, end systems, or\r\napplications.","pub_date":"March 2018","keywords":["performance","bulk capacity","BTC","diagnostic","statistics"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8337","errata_url":null}