{"draft":"draft-ietf-appsawg-mdn-3798bis-16","doc_id":"RFC8098","title":"Message Disposition Notification","authors":["T. Hansen, Ed.","A. Melnikov, Ed."],"format":["ASCII","HTML"],"page_count":"37","pub_status":"INTERNET STANDARD","status":"INTERNET STANDARD","source":"ART Area General Application Working Group","abstract":"This memo defines a MIME content type that may be used by a Mail User\r\nAgent (MUA) or electronic mail gateway to report the disposition of a\r\nmessage after it has been successfully delivered to a recipient.\r\nThis content type is intended to be machine processable.  Additional\r\nmessage header fields are also defined to permit Message Disposition\r\nNotifications (MDNs) to be requested by the sender of a message.  The\r\npurpose is to extend Internet Mail to support functionality often\r\nfound in other messaging systems, such as X.400 and the proprietary\r\n\"LAN-based\" systems, and are often referred to as \"read receipts,\"\r\n\"acknowledgements,\" or \"receipt notifications.\"  The intention is to\r\ndo this while respecting privacy concerns, which have often been\r\nexpressed when such functions have been discussed in the past.\r\n\r\nBecause many messages are sent between the Internet and other\r\nmessaging systems (such as X.400 or the proprietary \"LAN-based\"\r\nsystems), the MDN protocol is designed to be useful in a\r\nmultiprotocol messaging environment.  To this end, the protocol\r\ndescribed in this memo provides for the carriage of \"foreign\"\r\naddresses, in addition to those normally used in Internet Mail.\r\nAdditional attributes may also be defined to support \"tunneling\" of\r\nforeign notifications through Internet Mail.\r\n\r\nThis document is an Internet Standard.  It obsoletes RFC 3798 and\r\nupdates RFC 2046 (message\/partial media type handling) and RFC 3461\r\n(Original-Recipient header field generation requirement).","pub_date":"February 2017","keywords":["delivery notification","mdn"],"obsoletes":["RFC3798"],"obsoleted_by":[],"updates":["RFC2046","RFC3461"],"updated_by":[],"see_also":["STD0085"],"doi":"10.17487\/RFC8098","errata_url":null}