{"draft":"draft-ietf-taps-transports-14","doc_id":"RFC8095","title":"Services Provided by IETF Transport Protocols and Congestion Control Mechanisms","authors":["G. Fairhurst, Ed.","B. Trammell, Ed.","M. Kuehlewind, Ed."],"format":["ASCII","HTML"],"page_count":"54","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Transport Services","abstract":"This document describes, surveys, and classifies the protocol\r\nmechanisms provided by existing IETF protocols, as background for\r\ndetermining a common set of transport services.  It examines the\r\nTransmission Control Protocol (TCP), Multipath TCP, the Stream\r\nControl Transmission Protocol (SCTP), the User Datagram Protocol\r\n(UDP), UDP-Lite, the Datagram Congestion Control Protocol (DCCP), the\r\nInternet Control Message Protocol (ICMP), the Real-Time Transport\r\nProtocol (RTP), File Delivery over Unidirectional Transport \/\r\nAsynchronous Layered Coding (FLUTE\/ALC) for Reliable Multicast, NACK-\r\nOriented Reliable Multicast (NORM), Transport Layer Security (TLS),\r\nDatagram TLS (DTLS), and the Hypertext Transport Protocol (HTTP),\r\nwhen HTTP is used as a pseudotransport.  This survey provides\r\nbackground for the definition of transport services within the TAPS\r\nworking group.","pub_date":"March 2017","keywords":["Transmission Control Protocol (TCP)","Multipath TCP (MPTCP)","Stream Control Transmission Protocol (SCTP)","User Datagram Protocol (UDP)","UDP-Lite","Datagram Congestion Control Protocol (DCCP)","Internet Control Message Protocol (ICMP)","Real-Time Transport Protocol (RTP)","File Delivery over Unidirectional Transport\/Asynchronous Layered Coding (FLUTE\/ALC) for Reliable Multicast","NACK-Oriented Reliable Multicast (NORM)","Transport Layer Security (TLS)","Datagram TLS (DTLS)","Hypertext Transport Protocol (HTTP)","TAPS"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8095","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc8095"}