{"draft":"draft-ietf-teas-pce-central-control-05","doc_id":"RFC8283","title":"An Architecture for Use of PCE and the PCE Communication Protocol (PCEP) in a Network with Central Control","authors":["A. Farrel, Ed.","Q. Zhao, Ed.","Z. Li","C. Zhou"],"format":["ASCII","HTML"],"page_count":"25","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"Traffic Engineering Architecture and Signaling","abstract":"The Path Computation Element (PCE) is a core component of Software-\r\nDefined Networking (SDN) systems.  It can compute optimal paths for\r\ntraffic across a network and can also update the paths to reflect\r\nchanges in the network or traffic demands.\r\n\r\nPCE was developed to derive paths for MPLS Label Switched Paths\r\n(LSPs), which are supplied to the head end of the LSP using the Path\r\nComputation Element Communication Protocol (PCEP).\r\n\r\nSDN has a broader applicability than signaled MPLS traffic-engineered\r\n(TE) networks, and the PCE may be used to determine paths in a range\r\nof use cases including static LSPs, segment routing, Service Function\r\nChaining (SFC), and most forms of a routed or switched network.  It\r\nis, therefore, reasonable to consider PCEP as a control protocol for\r\nuse in these environments to allow the PCE to be fully enabled as a\r\ncentral controller.\r\n\r\nThis document briefly introduces the architecture for PCE as a\r\ncentral controller, examines the motivations and applicability for\r\nPCEP as a control protocol in this environment, and introduces the\r\nimplications for the protocol.  A PCE-based central controller can\r\nsimplify the processing of a distributed control plane by blending it\r\nwith elements of SDN and without necessarily completely replacing it.\r\n\r\nThis document does not describe use cases in detail and does not\r\ndefine protocol extensions: that work is left for other documents.","pub_date":"December 2017","keywords":["PCE","SDN"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8283","errata_url":null}