{"draft":"draft-ietf-lpwan-ipv6-static-context-hc-24","doc_id":"RFC8724","title":"SCHC: Generic Framework for Static Context Header Compression and Fragmentation","authors":["A. Minaburo","L. Toutain","C. Gomez","D. Barthel","JC. Zuniga"],"format":["HTML","TEXT","PDF","XML"],"page_count":"71","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"IPv6 over Low Power Wide-Area Networks","abstract":"This document defines the Static Context Header Compression and\r\nfragmentation (SCHC) framework, which provides both a header\r\ncompression mechanism and an optional fragmentation mechanism. SCHC\r\nhas been designed with Low-Power Wide Area Networks (LPWANs) in mind.\r\n\r\nSCHC compression is based on a common static context stored both in\r\nthe LPWAN device and in the network infrastructure side. This\r\ndocument defines a generic header compression mechanism and its\r\napplication to compress IPv6\/UDP headers.\r\n\r\nThis document also specifies an optional fragmentation and reassembly\r\nmechanism. It can be used to support the IPv6 MTU requirement over\r\nthe LPWAN technologies. Fragmentation is needed for IPv6 datagrams\r\nthat, after SCHC compression or when such compression was not\r\npossible, still exceed the Layer 2 maximum payload size.\r\n\r\nThe SCHC header compression and fragmentation mechanisms are\r\nindependent of the specific LPWAN technology over which they are\r\nused. This document defines generic functionalities and offers\r\nflexibility with regard to parameter settings and mechanism choices.\r\nThis document standardizes the exchange over the LPWAN between two\r\nSCHC entities. Settings and choices specific to a technology or a\r\nproduct are expected to be grouped into profiles, which are specified\r\nin other documents. Data models for the context and profiles are out\r\nof scope.","pub_date":"April 2020","keywords":["header compression","compression","fragmentation","static context","rule-based","LPWAN","LPWANs","low power","low-power","6LoWPAN","6lo","LoWPAN","LoWPANs","LLN","LLNs","LTN","LTE","LTE-M","Sigfox","LoRaWAN","NB-IOT","5G","IoT","Internet of Things","adaptation layer","UDP","IPv6","WSN","Sensor network","wireless sensor network","802.15.4","contrained network","constrained node","constrained-node network"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":["RFC9441"],"see_also":[],"doi":"10.17487\/RFC8724","errata_url":null}