{"draft":"draft-iab-marnew-report-02","doc_id":"RFC8462","title":"Report from the IAB Workshop on Managing Radio Networks in an Encrypted World (MaRNEW)","authors":["N. Rooney","S. Dawkins, Ed."],"format":["ASCII","HTML"],"page_count":"28","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"IAB","abstract":"The Internet Architecture Board (IAB) and GSM Association (GSMA) held\r\na joint workshop on Managing Radio Networks in an Encrypted World\r\n(MaRNEW), on September 24-25, 2015.  This workshop aimed to discuss\r\nsolutions for bandwidth optimization on mobile networks for encrypted\r\ncontent, as current solutions rely on unencrypted content, which is\r\nnot indicative of the security needs of today's Internet users.  The\r\nworkshop gathered IETF attendees, IAB members, and participants from\r\nvarious organizations involved in the telecommunications industry\r\nincluding original equipment manufacturers, content providers, and\r\nmobile network operators.\r\n\r\nThe group discussed Internet encryption trends and deployment issues\r\nidentified within the IETF and the privacy needs of users that should\r\nbe adhered to.  Solutions designed around sharing data from the\r\nnetwork to the endpoints and vice versa were then discussed; in\r\naddition, issues experienced when using current transport-layer\r\nprotocols were also discussed.  Content providers and Content\r\nDelivery Networks (CDNs) gave their own views of their experiences\r\ndelivering their content with mobile network operators.  Finally,\r\ntechnical responses to regulation were discussed to help the\r\nregulated industries relay the issues of impossible-to-implement or\r\nbad-for-privacy technologies back to regulators.\r\n\r\nA group of suggested solutions were devised, which will be discussed\r\nin various IETF groups moving forward.","pub_date":"October 2018","keywords":["Networks"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8462","errata_url":null}