{"draft":"draft-kanugovi-intarea-mams-framework-04","doc_id":"RFC8743","title":"Multiple Access Management Services Multi-Access Management Services (MAMS)","authors":["S. Kanugovi","F. Baboescu","J. Zhu","S. Seo"],"format":["HTML","TEXT","PDF","XML"],"page_count":"143","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"INDEPENDENT","abstract":"In multiconnectivity scenarios, the clients can simultaneously\r\nconnect to multiple networks based on different access technologies\r\nand network architectures like Wi-Fi, LTE, and DSL.  Both the quality\r\nof experience of the users and the overall network utilization and\r\nefficiency may be improved through the smart selection and\r\ncombination of access and core network paths that can dynamically\r\nadapt to changing network conditions.\r\n\r\nThis document presents a unified problem statement and introduces a\r\nsolution for managing multiconnectivity.  The solution has been\r\ndeveloped by the authors based on their experiences in multiple\r\nstandards bodies, including the IETF and the 3GPP.  However, this\r\ndocument is not an Internet Standards Track specification, and it\r\ndoes not represent the consensus opinion of the IETF.\r\n\r\nThis document describes requirements, solution principles, and the\r\narchitecture of the Multi-Access Management Services (MAMS)\r\nframework. The MAMS framework aims to provide best performance while\r\nbeing easy to implement in a wide variety of multiconnectivity\r\ndeployments.  It specifies the protocol for (1) flexibly selecting\r\nthe best combination of access and core network paths for the uplink\r\nand downlink, and (2) determining the user-plane treatment (e.g.,\r\ntunneling, encryption) and traffic distribution over the selected\r\nlinks, to ensure network efficiency and the best possible application\r\nperformance.","pub_date":"March 2020","keywords":["Integration","Aggregation","Switching","MPTCP","MPQUIC","GMA","5G","LTE","Wi-Fi","Ethernet","Edge","Proxy"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC8743","errata_url":"https:\/\/www.rfc-editor.org\/errata\/rfc8743"}