{"draft":"draft-ietf-avtcore-multi-party-rtt-mix-20","doc_id":"RFC9071","title":"RTP-Mixer Formatting of Multiparty Real-Time Text","authors":["G. Hellström"],"format":["HTML","TEXT","PDF","XML"],"page_count":"35","pub_status":"PROPOSED STANDARD","status":"PROPOSED STANDARD","source":"Audio\/Video Transport Core Maintenance","abstract":"This document provides enhancements of real-time text (as specified\r\nin RFC 4103) suitable for mixing in a centralized conference model,\r\nenabling source identification and rapidly interleaved transmission\r\nof text from different sources. The intended use is for real-time\r\ntext mixers and participant endpoints capable of providing an\r\nefficient presentation or other treatment of a multiparty real-time\r\ntext session. The specified mechanism builds on the standard use of\r\nthe Contributing Source (CSRC) list in the Real-time Transport\r\nProtocol (RTP) packet for source identification. The method makes use\r\nof the same \"text\/t140\" and \"text\/red\" formats as for two-party\r\nsessions. \r\n\r\nSolutions using multiple RTP streams in the same RTP session are\r\nbriefly mentioned, as they could have some benefits over the\r\nRTP-mixer model. The RTP-mixer model was selected to be used for the\r\nfully specified solution in this document because it can be applied\r\nto a wide range of existing RTP implementations. \r\n\r\nA capability exchange is specified so that it can be verified that a\r\nmixer and a participant can handle the multiparty-coded real-time\r\ntext stream using the RTP-mixer method. The capability is indicated\r\nby the use of a Session Description Protocol (SDP) (RFC 8866) media\r\nattribute, \"rtt-mixer\". \r\n\r\nThis document updates RFC 4103 (\"RTP Payload for Text Conversation\").\r\n\r\n\r\nA specification for how a mixer can format text for the case when the\r\nendpoint is not multiparty aware is also provided.","pub_date":"July 2021","keywords":["conference","bridge","SIP"],"obsoletes":[],"obsoleted_by":[],"updates":["RFC4103"],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC9071","errata_url":null}