{"draft":"draft-ietf-tsvwg-ecn-l4s-id-29","doc_id":"RFC9331","title":"The Explicit Congestion Notification (ECN) Protocol for Low Latency, Low Loss, and Scalable Throughput (L4S)","authors":["K. De Schepper","B. Briscoe, Ed."],"format":["HTML","TEXT","PDF","XML"],"page_count":"52","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"Transport and Services Working Group","abstract":"This specification defines the protocol to be used for a new network\r\nservice called Low Latency, Low Loss, and Scalable throughput (L4S).\r\nL4S uses an Explicit Congestion Notification (ECN) scheme at the IP\r\nlayer that is similar to the original (or 'Classic') ECN approach,\r\nexcept as specified within. L4S uses 'Scalable' congestion control,\r\nwhich induces much more frequent control signals from the network,\r\nand it responds to them with much more fine-grained adjustments so\r\nthat very low (typically sub-millisecond on average) and consistently\r\nlow queuing delay becomes possible for L4S traffic without\r\ncompromising link utilization. Thus, even capacity-seeking (TCP-like)\r\ntraffic can have high bandwidth and very low delay at the same time,\r\neven during periods of high traffic load.\r\n\r\nThe L4S identifier defined in this document distinguishes L4S from\r\n'Classic' (e.g., TCP-Reno-friendly) traffic. Then, network\r\nbottlenecks can be incrementally modified to distinguish and isolate\r\nexisting traffic that still follows the Classic behaviour, to prevent\r\nit from degrading the low queuing delay and low loss of L4S traffic.\r\nThis Experimental specification defines the rules that L4S transports\r\nand network elements need to follow, with the intention that L4S\r\nflows neither harm each other's performance nor that of Classic\r\ntraffic. It also suggests open questions to be investigated during\r\nexperimentation. Examples of new Active Queue Management (AQM)\r\nmarking algorithms and new transports (whether TCP-like or real time)\r\nare specified separately.","pub_date":"January 2023","keywords":["Burstiness","Performance","Queuing Delay","One Way Delay","Round-Trip Time","RTT","Jitter","Congestion Control","Congestion Avoidance","Quality of Service","QoS","Quality of Experience","QoE","Active Queue Management","AQM","Explicit Congestion Notification","ECN","Pacing"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC9331","errata_url":null}