{"draft":"draft-crocker-email-deliveredto-10","doc_id":"RFC9228","title":"Delivered-To Email Header Field","authors":["D. Crocker, Ed."],"format":["HTML","TEXT","PDF","XML"],"page_count":"10","pub_status":"EXPERIMENTAL","status":"EXPERIMENTAL","source":"INDEPENDENT","abstract":"The address to which email is delivered might be different than any\r\nof the addresses shown in any of the content header fields that were\r\ncreated by the email's author. For example, the address used by the\r\nemail transport service is provided separately, such as through\r\nSMTP's \"RCPT TO\" command, and might not match any address in the To:\r\nor cc: fields. In addition, before final delivery, handling can\r\nentail a sequence of submission\/delivery events, using a sequence of\r\ndifferent destination addresses that (eventually) lead to the\r\nrecipient. As well, a receiving system's delivery process can produce\r\nlocal address transformations.\r\n\r\nIt can be helpful for a message to have a common way to record each\r\ndelivery in such a sequence, noting each address used in the sequence\r\nto that recipient, such as for (1) analyzing the path a message has\r\ntaken, (2) loop detection, or (3) formulating the author's address in\r\na reply message.  This document defines a header field for this\r\ninformation.\r\n\r\nEmail handling information discloses details about the email\r\ninfrastructure, as well as about a particular recipient; this can\r\nraise privacy concerns.\r\n\r\nA header field such as this is not automatically assured of\r\nwidespread use. Therefore, this document is being published as an\r\nExperimental RFC, looking for constituency and for operational\r\nutility. This document was produced through the Independent\r\nSubmission Stream and was not subject to the IETF's approval process.","pub_date":"April 2022","keywords":["handling","email","mhs","recipient","transport","delivery","mda","mta","relay","header"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC9228","errata_url":null}